app/views/event_categories/index.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."event_category_id" = $1  [["event_category_id", 1]]
---
        <td><%= link_to 'Edit', edit_event_category_path(event_category) %></td>
        <td><% if event_category.events.count > 0 %>

SELECT "event_categories".* FROM "event_categories"
---
<br>
<%= select("category", "category_id", EventCategory.all.collect {|p| [ p.name, p.id ] }, includes_blank: 'None') %>