app/views/users/_user.html.erb

      <span class="ui-select">
      <%= f.select(:role, User.roles.keys.map {|role| [role.upcase,role]}) %>
---
SELECT "roles".id FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 1]]