app/views/users/_user.html.erb


       <%= f.collection_select(:role_ids,Role.all,:id,:name) %>
---
SELECT "roles".* FROM "roles"