app/views/events/_event.html.erb

SELECT COUNT(*) FROM "roles" INNER JOIN "event_roles" ON "roles"."id" = "event_roles"."role_id" WHERE "event_roles"."event_id" = $1  [["event_id", 3]]
---
<p>Dieser Termin ist für
  <% if event.roles.count > 0 %>