app/views/events/_form.html.erb

      <p>Eventtyp:</p>
      <%= f.collection_select :event_category_id, EventCategory.all, :id, :name, {selected: @event.event_category_id}, :class => 'form-control' %>
---
SELECT "event_categories".* FROM "event_categories"