app/views/events/_review_form.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
    <% elsif event.rejected? %>
        <p>Dieses Element darf nicht veröffentlicht werden, hat <%= User.find(event.manager_id).username %> entschieden.</p>