app/views/fullcalendar/_calendar.html.erb

SELECT "event_categories".* FROM "event_categories"
---
    <select class="form-control" id="category_category_id" >
      <%= options_for_select EventCategory.all.collect { |c| [c.name, c.id]}.insert(0, "Alle anzeigen") %>