app/views/fullcalendar/index.html.erb

SELECT "event_categories".* FROM "event_categories"
---
    <select class="form-control" id="category_category_id">
    <%= options_for_select(EventCategory.all.collect{ |c| [c.name, c.id]}) %>