app/controllers/build_controller.rb

  def show
    @event = Event.find(params[:event_id])
    if @event.repeats
      if !@event.recurrence.present?
#Create a new recurrence with the date of our event.
   recurrence = Recurrence.new(start: @event.start.to_date, end: @event.start.to_date + 1.month, owner: @event)
   recurrence.save!(:validate=> false)
   @event.recurrence = recurrence
        @event.save!(:validate=> false)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "recurrences" ("start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["start", "2016-02-24"], ["end", "2016-03-24"], ["created_at", "2016-02-23 10:31:41.536842"], ["updated_at", "2016-02-23 10:31:41.536842"]]
UPDATE "events" SET "recurrence_id" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["recurrence_id", 3], ["updated_at", "2016-02-23 10:31:41.567282"], ["id", 6]]

  def update
    @event = Event.find(params[:event_id])
    @recurrence = @event.recurrence
    case step
      when :build

        @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "events" SET "title" = $1, "event_category_id" = $2, "flag" = $3, "imageURL" = $4, "url" = $5, "ort" = $6, "description" = $7, "repeats" = $8, "start" = $9, "end" = $10, "updated_at" = $11 WHERE "events"."id" = $12

  def new
    @event = Event.new
    @event.save!(:validate=> false)
---
INSERT INTO "events" ("priority", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["priority", 2], ["start", "2016-02-24 10:31:26.904461"], ["end", "2016-02-24 11:31:26.904461"], ["created_at", "2016-02-23 10:31:26.905016"], ["updated_at", "2016-02-23 10:31:26.905016"]]