app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    events = Event.submitted
    publishedEvents = Array.new
    events.each do |event|

SELECT "event_roles".* FROM "event_roles" WHERE "event_roles"."event_id" = $1  [["event_id", 1]]
INSERT INTO "events" ("title", "start", "priority", "flag", "imageURL", "url", "end", "ort", "description", "event_category_id", "repeats", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def edit
copy= @event.deep_clone( include: [:event_roles,{recurrence: [:rules,:excludes]}],except:[:state])
if @event.parent.blank?
copy.parent = @event
else
  copy.parent = @event.parent
  end
copy.author = nil
copy.message = nil
copy.manager = nil
copy.admin = nil
copy.save!

INSERT INTO "events" ("title", "event_category_id", "priority", "flag", "imageURL", "url", "ort", "description", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "admin_id" = $1, "state" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["admin_id", 1], ["state", 4], ["updated_at", "2016-02-27 20:57:37.066671"], ["id", 3]]
---
  def update
    if ablehnen?
      @event.message = params[:event][:message]
      @event.manager_id = current_user.id
      @event.rejected!
      @event.save