app/controllers/event_categories_controller.rb

SELECT "event_categories".* FROM "event_categories"
---
  def index
    @event_categories = EventCategory.all

SELECT  "event_categories".* FROM "event_categories" WHERE "event_categories"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_event_category
      @event_category = EventCategory.find(params[:id])