app/controllers/newsletters_controller.rb

SELECT "newsletters".* FROM "newsletters"
---
  def index
    @newsletters = Newsletter.all

INSERT INTO "newsletters" ("subject", "description", "from", "to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @newsletter = Newsletter.new(newsletter_params)
      respond_to do |format|
        if @newsletter.save

UPDATE "newsletters" SET "description" = $1, "updated_at" = $2 WHERE "newsletters"."id" = $3  [["description", "dfgfgdgfdfdg fefsdffsf "], ["updated_at", "2016-02-27 21:59:41.298694"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @newsletter.update(newsletter_params)

SELECT  "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = $1 LIMIT 1  [["id", 8]]
---
    def set_newsletter
      @newsletter = Newsletter.find(params[:id])