app/controllers/subscribers_controller.rb

  def index
    @subscribers = Subscriber.all
---
SELECT "subscribers".* FROM "subscribers"

  def create
    @subscriber = Subscriber.new(subscriber_params)

    respond_to do |format|
      if @subscriber.save
---
INSERT INTO "subscribers" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jannik"], ["email", "jannikwortmann92@gmail.com"], ["created_at", "2016-02-27 21:52:49.972366"], ["updated_at", "2016-02-27 21:52:49.972366"]]

    def set_subscriber
      @subscriber = Subscriber.find(params[:id])
---
SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT 1  [["id", 1]]