app/controllers/users_controller.rb

  def index

    authorize (current_user)
    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    authorize(current_user)
    role = params[:user][:role_ids]
 roleModel =Role.find( role)
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 3]]

  def set_User
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]